# <center>Tabalhando com Dados Ausentes</center>

### importando pandas

In [2]:
import pandas as pd

### definindo lista com dados

In [3]:
temps = pd.DataFrame({
    "sequence":[1,2,3,4,5],
    "measurement_type": ['actual', 'actual', 'actual', None, 'estimated'],
    "temperature_f": [67.24, 84.56, 91.61, None, 49.64]
})
temps

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
3         4             None            NaN
4         5        estimated          49.64

### exibindo se há valores ou não com isna()

In [4]:
temps.isna()

   sequence  measurement_type  temperature_f
0     False             False          False
1     False             False          False
2     False             False          False
3     False              True           True
4     False             False          False

### acumulando dados (somando a linha atual com os dados da anterior)

In [6]:
temps['temperature_f'].cumsum()

0     67.24
1    151.80
2    243.41
3       NaN
4    293.05
Name: temperature_f, dtype: float64

### interromper o somatório acumulativo ao encontrar uma linha nula

In [7]:
temps['temperature_f'].cumsum(skipna=False)

0     67.24
1    151.80
2    243.41
3       NaN
4       NaN
Name: temperature_f, dtype: float64

### usando goupby para agrupar dados por dimensão

In [10]:
temps.groupby(by=['measurement_type']).max()
# para incluir as colunas onde há dados nulos
# temps.groupby(by=['measurement_type'], dropna=False).max()

                  sequence  temperature_f
measurement_type
actual                   3          91.61
estimated                5          49.64

### removendo todas as linhas nulas com dropna()

In [11]:
temps.dropna()

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
4         5        estimated          49.64

### removendo colunas com valores nulos

In [12]:
temps.dropna(axis=1)

   sequence
0         1
1         2
2         3
3         4
4         5

### substituir valores nulos com fillna()

In [13]:
temps.fillna(0)

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
3         4                0           0.00
4         5        estimated          49.64

### substituir com valor anterior a coluna nula

In [14]:
temps.fillna(method='pad')

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
3         4           actual          91.61
4         5        estimated          49.64

### substituir valores nulos com valores que ficam entre o valor anterior e o próximo

In [15]:
temps.interpolate()

   sequence measurement_type  temperature_f
0         1           actual         67.240
1         2           actual         84.560
2         3           actual         91.610
3         4             None         70.625
4         5        estimated         49.640